{
  "format": "layers-model",
  "generatedBy": "keras v2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.22.0",
  "modelTopology": {
    "keras_version": "2.15.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "modelo_libras",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 63],
              "dtype": "float32",
              "sparse": false,
              "name": "entrada"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "oculta_1",
              "trainable": true,
              "dtype": "float32",
              "units": 128,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"class_name": "Zeros", "config": {}}
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "drop_1",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.2,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "oculta_2",
              "trainable": true,
              "dtype": "float32",
              "units": 64,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"class_name": "Zeros", "config": {}}
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "drop_2",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.1,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "saida",
              "trainable": true,
              "dtype": "float32",
              "units": 21,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}},
              "bias_initializer": {"class_name": "Zeros", "config": {}}
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "sparse_categorical_crossentropy",
      "metrics": ["accuracy"],
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "name": "adam",
          "learning_rate": 0.001
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "oculta_1/kernel", "shape": [63, 128], "dtype": "float32" },
        { "name": "oculta_1/bias", "shape": [128], "dtype": "float32" },
        { "name": "oculta_2/kernel", "shape": [128, 64], "dtype": "float32" },
        { "name": "oculta_2/bias", "shape": [64], "dtype": "float32" },
        { "name": "saida/kernel", "shape": [64, 21], "dtype": "float32" },
        { "name": "saida/bias", "shape": [21], "dtype": "float32" }
      ]
    }
  ]
}